# Лабораторная работа 13: Строка как массив символов

## 📋 Цель работы
Изучение работы со строками в языке C как с массивами символов, использование функций для работы со строками и символами.

## 🎯 Задание
Составить программу, которая во введенной пользователем строке подсчитывает количество знаков препинания (не буква и не цифра перед пробелом) во второй половине строки.


## 🧮 Алгоритм работы программы
1. Инициализация программы и настройка кодировки
2. Ввод строки от пользователя с использованием функции `fgets()`
3. Удаление символа новой строки `\n` из конца строки
4. Определение длины строки и середины
5. Поиск во второй половине строки символов, не являющихся буквами или цифрами
6. Проверка, что после найденного символа идет пробел или он находится в конце строки
7. Подсчет количества таких символов
8. Вывод результатов на экран

## 📁 Структура репозитория

Lab13/

├── Code.c - # Исходный код программы

└── README.md

## 🖥️ Пример работы программы
Введите строку: Hello, world! This is a test. How are you?
Вторая половина строки: is a test. How are you?
Найден знак препинания '.' на позиции 24

Количество знаков препинания во второй половине строки: 1

## 📝 Исходный код
```c
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

int main() {
    system("chcp 1251 > nul");
    
    char str[1000];
    
    printf("Введите строку: ");
    fgets(str, sizeof(str), stdin);
    
    // Убираем символ новой строки
    size_t len = strlen(str);
    if (len > 0 && str[len - 1] == '\n') {
        str[len - 1] = '\0';
        len--;
    }
    
    // Находим середину строки
    int middle = len / 2;
    int count = 0;
    
    // Используем указатели для работы со строкой
    char *ptr = str + middle;
    
    printf("Вторая половина строки: %s\n", ptr);
    
    // Проходим по второй половине строки
    for (int i = middle; i < len; i++) {
        char current = str[i];
        // Пропускаем пробелы
        if (current == ' ') {
            continue;
        }
        
        // Проверяем, что текущий символ не буква и не цифра
        if (!isalnum(current)) {
            // Проверяем, что после знака препинания идет пробел
            if (i + 1 < len && str[i + 1] == ' ') {
                count++;
                printf("Найден знак препинания '%c' на позиции %d\n", current, i + 1);
            }
            // Или если это последний символ в строке (не пробел)
            else if (i == len - 1 && current != ' ') {
                count++;
                printf("Найден знак препинания '%c' на позиции %d\n", current, i + 1);
            }
        }
    }
    
    printf("\nКоличество знаков препинания во второй половине строки: %d\n", count);
    
    return 0;
}
```
## 👤 Автор
Чапэ Максим Сергеевич

Группа: бТИИ-251